[
  {
    "title": "Animal Roundup",
    "category": "Team Building Activity",
    "details": "Ever feel like your group is low on energy? This could get the team going. Tell group members to silently think of their favorite animal. Then, tell group members that without talking, they need to arrange themselves from largest to smallest animals. Group members can only make gestures and the noise of their animal. After they have finished, have group members go around and say the animal they were supposed to be to see if everyone was accurate."
  },
  {
    "title": "Thanks Giving",
    "category": "Team Building Activity",
    "details": "Explain to the group that often the difference between a 'thankless job' and one that is more gratifying is when co-workers actually appreciate and acknowledge your contributions. Distribute blank paper slips and pencils. Ask group members to write a note thanking each of their team members for a particular time, event, or behavior. Or, they can write compliments, encouraging messages, or kind words that describe a group member. Collect the messages and distribute them to the appropriate individuals so they can read them privately. Or, if the group so chooses, they can be shared out loud for everyone to hear. The power of this activity is in the result, not the process!"
  },
  {
    "title": "Pipe Cleaners",
    "category": "Team Building Activity",
    "details": "This activity allows participants to be creative. Give everyone three pipe cleaners and challenge them to create a pipe cleaner sculpture. Encourage them to do anything they want! At the end of the activity, have each person share their sculpture and then have everyone select an overall winner. As a variation, have the entire group work as a team to combine their sculptures using them all together to make something 'better'."
  },
  {
    "title": "Process Ball",
    "category": "Team Building Activity",
    "details": "This is a review and wake-up exercise. Have everyone stand up and form a circle. Toss a foam ball or bean bag to a person and have them tell one step of an important store process or procedure. They then toss the ball to someone else and that person must continue by adding the next step or detail. The activity leader can follow along by writing the steps on a white board or flip chart. This activity can also be applied to other subjects like product knowledge or sales techniques with each person contributing an important learning concept to help explain the material."
  },
  {
    "title": "Humble Brag and Burning Questions",
    "category": "Team Building Activity",
    "details": "Have each team member think of something they accomplished at work recently that they are proud of. In some order, have each person share their accomplishment with the group. Encourage everyone to congratulate and acknowledge that individual as well as ask questions like ‘How did you get the idea to do that?’, ‘What was the most challenging part about getting that done?’, ‘What will be the biggest benefit now that has been completed?’ etc. By asking questions, everyone can learn from the positive actions taken by others and, through discussion, everyone learns what behaviors and patterns of thought are valued and reinforced by the team culture."
  },
  {
    "title": "Common Ground",
    "category": "Team Building Activity",
    "details": "This activity allows participants to get to know and appreciate one another better through discovering both common and unique interests and experiences. It will help people be more comfortable talking and listening with one another. Make pairs of two people (preferably two who don’t particularly associate with each other much). Give the groups a specific time to write a list of everything they have in common. When time is up, ask each group how many items they have listed. Consider giving a prize to the pair that found the most in common. For fun, ask the teams to announce some of the most interesting items they discovered."
  },
  {
    "title": "Candy Love",
    "category": "Team Building Activity",
    "details": "This is a great team building activity that gets the participants talking about their role at work but also to open up about their life beyond work activities. Place a package of colorful candies in a jar. Ask a participant to pick up a candy from the jar and then share something about him/herself according to the candy color. For example: If it is red, share one thing that you love about your job. This is interesting because it will help them focus on the positive side about their work. Yellow, a life goal you are working on. This gives everyone positive vibes and inspiration. Green, your favorite book or movie. Everyone has hobbies and past-time recreations so this diverts attention to the things they love to do. Purple, favorite way to revive yourself during the work day. This can be empowering to identify ways to blow off steam and is informative to others on the team. Blue, one stressful thing about your job you wish you could improve. This is actually motivating because it will convert negative things into something positive and prompt ideas for how to change things. Orange, favorite food. Everyone loves food-- it is a topic that picks up everyone’s interest. After the first person has shared, the next participant will proceed in the same way and the activity will continue like this until time is over or all the candy is gone!"
  },
  {
    "title": "The Direct Close",
    "category": "Sales Techniques",
    "details": "‘Would you like to go ahead and get it?’ or ‘What do you think, is this the one you want?’ This is the standard sales close because it works and is not offensive. The customer doesn’t have to try to understand your point because it’s so direct. This close is so effective because it’s so simple.  Hot tip: Do not embellish it. It’s called direct for a reason. Ask directly and wait and listen."
  },
  {
    "title": "The Summary Close",
    "category": "Sales Techniques",
    "details": "‘With its reliable waterproof shell, and its removable hood you thought was important, plus the versatile style so it can look good wearing it over your suit, this seems like the jacket for you.  What do you think?’ You have summarized the features and benefits the customer has liked, accepted, or requested. You are also summarizing the reasons why the customer should want the jacket. Hot tip: Use this close for the fact-oriented person, the type who reads reviews before shopping. They want to be logical about this. The summary close will confirm that the facts are important."
  },
  {
    "title": "The Accessory Close",
    "category": "Sales Techniques",
    "details": "‘Are you going to want shin-guards and socks with that?’ If they say yes, then they are buying the soccer cleats. If they say no, they are just getting the soccer cleats, hold the accessories. Hot tip: Use this close with customers who are quick to pick out a specific pair of shoes and are jazzed about getting out and playing. It works well with the ‘let’s go right now, wow’ customer."
  },
  {
    "title": "The Choice Close",
    "category": "Sales Techniques",
    "details": "‘What do you think?  Do you want the red one or the blue one?’ If you have both colors in the correct size, this works great unless the customer is diffident. Hot Tip: Choice works best with the type of customer who might be called the strong silent type, the person of few words. They use few words so no one mistakes them for a babbling idiot. Grunting out one word like ‘blue’ allows them to reconfirm that they are strong and silent."
  },
  {
    "title": "The Test Ride Enrapture Capture Close",
    "category": "Sales Techniques",
    "details": "‘That bike rides great doesn’t it?  Wow, look at your grin. You love it, don’t you?’ Only two things are required for this to work. First the customer has to ride the bike. Second, you have to be outside watching their mood upon return. If they ride it and like it and you’re excited for them, they’ll probably get it. They’ll buy it if they liked the price range and the color before riding it. Hot tip: this is the most fun way to sell a bike."
  },
  {
    "title": "The Assumptive Close",
    "category": "Sales Techniques",
    "details": "‘When shall we deliver it to you?’ Act as if the customer has made their decision already. Turn the focus of the conversation to the next level of questions such as how many they want, what size they need, etc. Acting confidently as if something is true makes it difficult for the other person to deny it. For them to say you are wrong, would be casting themselves as a naysayer. "
  },
  {
    "title": "The Compliment Close",
    "category": "Sales Techniques",
    "details": "‘Wow, I can tell you did your research. You really know your stuff. Would you like to buy this now?’ Be nice to them. Tell them how wonderful they are. Be amazed and impressed by them. Cast them as the expert so they sell to themselves. Tell them how good they look or sound. Tell them how others will be impressed by them. Tell them how impressed you are with them as a person. Admire their integrity. Then ask for the sale. The Compliment Close works by flattering the other person, massaging their ego so they are more concerned with feeling good than parting with their money. It can help to associate the person with the product, so they feel their sense of identity becoming attached to the product. It also works by being nice to the other person so they feel obliged to be nice to you and buy your product. Putting the other person on a pedestal and admiring them encourages them to live up to the high expectations you have of them. Hot tip: Complimenting them on a previous purchase is telling them that they make gooddecisions (and hence can make a good decision this time too)."
  },
  {
    "title": "The Companion Close",
    "category": "Sales Techniques",
    "details": "‘Hello young man, that's a nice hat! Do you like shoes too?...Do you like these?’ Rather than sell directly to the person you are targeting, sell to a person they are with. This can be a husband, wife, child, friend, grandparent, etc. Start by being friendly with them (the target person won't mind this) then gradually increase the selling to them. Cast them as an authority (particularly as they buy into your idea). When they are making approving noises or say they would like one, start selling to the real target of the sale. Rope in the companion as a sales assistant- if you are lucky, you might make two sales! The Companion Close works because the companion to whom you are selling the idea does not have to make a financial or other commitment and so will be more ready to agree with you. When the real target of the sale sees that the other person has agreed, they are more likely to also agree, in order to maintain consistency with their thoughts of their companion being intelligent and to maintain harmony in their relationship with them."
  },
  {
    "title": "The Demonstration Close",
    "category": "Sales Techniques",
    "details": "‘You won’t believe this. I didn’t either when I first saw it. Just watch…’ If you are able to, do a spectacular demonstration of your product that really makes them 'wow'. If you can't do it with them there (which is by far and away the best), then use a video or otherwise add impact. Give them a go. Let them try and find out for themselves. The Demonstration Close works by giving them evidence that they cannot deny. The visceral experience of sensing a product being used cannot be beaten by talk or even explicit pictures. It is particularly effective if they have alreadypredicted that your demonstration will not work as, being forced to revise a prediction they will also have to revise the beliefs on which it was based."
  },
  {
    "title": "The Empathy Close",
    "category": "Sales Techniques",
    "details": "‘I completely understand...and you know, this solution works so well for me, it makes so much sense to me to do this now.’ Empathize with them. Feel what they feel. Walk a mile in their shoes. Understand their situation completely. Then, when they are empathizing back, youdecide like they would decide. You can even talk about yourself, using 'I' instead of 'you'. Also empathize with the product you are selling and bring this into the equation. Be a match-maker in bringing this great product to a worthy customer. The Empathy Close works by first harmonizingyourself with them and then, when you feel what it is like for them to close, they naturally come along with you. Done well, you will close at exactly the right moment and for exactly the rightreasons for them, and they will come back again and again."
  },
  {
    "title": "The IQ Close",
    "category": "Sales Techniques",
    "details": "‘This is a really clever solution. I sold one of these to a doctor yesterday.’ Imply that intelligent people make this purchase. This is particularly useful in selling technology where people may shy away from the complexity. The intelligence can also be associated with simply doing a good deal. You can also imply that it is stupid not to buy. The IQ Close works by associating intelligence with closure. Thus, if people think they are intelligent (and we all do) they will be attracted towards purchasing the product and hence feeling that they are intelligent. If the person has an avoidance preference, then implying they would be stupid not to buy makes them aim to avoid the stupidity."
  },
  {
    "title": "The Never the Best Time Close",
    "category": "Sales Techniques",
    "details": "‘The best time to buy is when you need it--which I'd say is now, wouldn't you? If you leave it until next year, you'll have one year less to enjoy it.’ When people are procrastinating or dithering over whether they should buy now or buy later, show them that delaying will either get them no advantage or may even be to their disadvantage. Talk about what they will miss by not having it over the coming period. Give examples of people who waited for the best moment, which never came. The Never the Best Time Close works by reframing delaying tactics as value-destroying procrastination."
  },
  {
    "title": "The No-Hassle Close",
    "category": "Sales Techniques",
    "details": "‘I've filled in all the paperwork and all you need is to sign here. It will be delivered Tuesday, when you are in, and fully installed by qualified fitters.’ Make completing the deal so completely easy for them that any thought that might put them off is not there. Fill in all forms for them. Do all the paperwork. Include delivery, installation and setup. The No-Hassle Close works by being so simple and easy for the other person that any anticipated difficulty or hassle that may be holding them back is blown away. It also encourages them to return the favor as an exchange for your help with the completion of the sale."
  },
  {
    "title": "The Treat Close",
    "category": "Sales Techniques",
    "details": "‘I can see that you like it. You know, I really think you deserve it. Go on, treat yourself!’ If you are selling something that you know they would like but cannot justify to themselves that they should buy it, then persuade them that they deserve a treat. Point out how hard they have worked and that this would be a good reward. Find out if they have given things to others. Point out that they need to be good to themselves as well. Give them the excuse they need. Give them a reason they can tell themselves why it is a good thing to buy now. The Treat Close evokes the need for fair play, showing the other person as needing something to make up for other things they have done. It frames the other person as the deserving recipient."
  },
  {
    "title": "Good, Better, Best. Less is More.",
    "category": "Sales Techniques",
    "details": "Some sales people feel like it’s important to give consumers more and more options. But, the modern world demands the average person make more choices on a daily basis, and many of us end up suffering from decision fatigue. So rather than recommending too many product variations, carefully curate a smaller selection based on the customer’s stated wants and needs. Paying attention to the ‘Rule of Three’ is a good bet since the average person’s short-term memory can only retain roughly three “chunks” of information at a time. With too many choices, you run the risk of making customers frustrated. In keeping with this, you can aim to show three products of varying features and price range with one being good, another better, and finally a best option. This way, you won’t overwhelm customers and actually make them more likely to buy."
  },
  {
    "title": "Follow Features With Benefits",
    "category": "Sales Techniques",
    "details": "Too often retail sales reps will begin a presentation by rattling off a list of features or specifications. But, we have websites and signs to list information like that. Customers are looking to you to relate what the features of a product actually do for them! Instead of using jargon or spouting off statistics, connect with a customer by framing their problem and highlighting how the particular aspects of the product you are showing them will be rewarding and help them accomplish their goals."
  },
  {
    "title": "Don't Get Lost in the Computer",
    "category": "Customer Service",
    "details": "When ringing out a sale or creating a work order, it can be easy to get sucked into what you’re doing on the computer and, in so doing, you can lose focus on the customer. The customer might end up standing there wondering what you’re doing or how much longer they have to stay there. You really need to communicate every step that you take. ‘I’m adding up all these items now. It will just take a moment.’ ‘I’m making sure to put in all the service items we talked about.’ ‘I just put your name in here and will be able to ring it through now.’ This helps the customer feel assured you are actively working with them to follow through on whatever they need. Sometimes you can make a mistake with something you enter and you might need a moment to figure out what went wrong. This is an especially easy time to lose focus on the customer. It is often helpful to blame the computer and say something like: ‘Sorry this is taking a little long, the computer has been acting up a bit’ or ‘The computer is a little sleepy today, but I’ll get this wrapped up quickly.’ This way you can buy some time for yourself and explain why it is taking a little longer than they might reasonably expect. Along with this, it is also top notch service to look up from the computer and make eye contact with the customer as much as possible. Some people are better typers than others, but taking a moment to look up when communicating what actions you are taking is important. Or, especially, if you are thanking the customer for their patience, looking at them and being sincere about it goes a long way."
  },
  {
    "title": "Compliment and Thank the Customer for a Purchase",
    "category": "Customer Service",
    "details": "Upon ringing out a sale, it is nice to offer a compliment to the customer so that they can be assured they are making a good choice. ‘This is definitely one of the easiest to use cameras, I think you’ll really like it.’ ‘I thought this necklace looked great on you.’ ‘This bike is really going to make it a snap to start biking to work.’ Overall, this affirmation makes it a little easier for them to hand over their credit card. Of course, once they have, when you ring out the sale you should thank them for their purchase. Make eye contact and be sincere!"
  },
  {
    "title": "It's Not About You",
    "category": "Customer Service",
    "details": "Do customers ask what phone you use or do they ask what phone you recommend for them? People come to the shop for your expert advice. And, yes, you are expert on phones, but you are not an expert on each customer. You must do your best to build a rapport and ask questions so that you can then translate the customer’s needs and wants and use your knowledge to make some good recommendations. Find out what they want to make them happy! Guide them, direct the sale. You should never let your own ideas about what is cool or what is best get in the way of making the best recommendations for each customer. You should never brag about what kind of phone you have or what you can do with your phone (unless asked directly). Even if you are asked what you like or what you think they should choose, always turn it back to how a recommendation you have made could suit the customer’s needs and wants as he or she described them to you."
  },
  {
    "title": "Don't Knock the Competition",
    "category": "Customer Service",
    "details": "One key thing to be mindful of is talking down a competitor. It might be hard to keep your mouth closed when a customer brings up a competing store or product, but just know that speaking negatively has the opposite effect from what you intend. Speaking poorly about a similar product or brand is often a turn off for customers. Anytime you say bad things about someone else, people associate those same traits with you. So, when you say a competitor is low-quality or unreliable, your prospective customer is actually linking those with you. Instead of badmouthing competitors or their products, acknowledge the customer’s question or comment and use the interaction as an opportunity to educate them about your offerings. Discuss how your product or services are great for solving a specific problem, and actively listen to what your customer needs."
  },
  {
    "title": "5 Steps for Effectively Handling Customer Complaints",
    "category": "Customer Service",
    "details": "When there is a service slip-up, and a customer feels let down or angry, it always presents an opportunity to turn that same customer into one of your most loyal customers. If you fix the problem they are actually more likely to return and even sing your praises. The more a company is able to fix what is wrong, the more they build a positive reputation. So, how a company handles complaints can ultimately be a powerful marketing force. And, for that reason, it is critical to have an effective system for handling and learning from customer complaints. First, you should acknowledge the customer’s complaint. This addresses their primary need to know that you will listen to them and will be on their side to solve the problem. Once you’ve acknowledged that you’ve heard the customer’s concerns, your next challenge is to apologize. Simply and sincerely with no excuses, no explanations, no badgering, and no sending them off to see someone else. Just something along the lines of ‘I regret this happened.’ When you have taken care of steps one and two, it’s time to do something to make things right for your customer. What you should do is usually surprisingly straightforward. They weren’t happy with the product? Replace it. Sometimes , it’s more complex-- since different people want different things. So a good way to figure out what will make things right for the customer is to simply ask them. Often they’ll come right out and tell you. For every customer who complains, there are numerous others who were just as unhappy but said nothing. This silent majority will voice its concerns with “economic criticism”—meaning they’ll simply spend their money at any other place within 10 miles that’s vying for dollars. A customer who cares enough to complain is providing a valuable opportunity to make things right. And though complaints are tough to hear they provide a chance to learn and improve your performance. So you should appreciate that your customers let you know where you’ve gone astray and you should express your appreciation by sincerely thanking them. Finally, in order to really learn from mistakes, it is important to document what customers have to say. This will help catch problems early when they’re just blips before they become trends. As part of writing an incident up, there can be next actions listed suggesting further follow up with the customer or other ways to go the extra mile and really make things right."
  }
]
